# default 값을 넣어주는 변수는 마지막에
def f(name, sid=2021):
    print(f'{name} and {sid}')

if __name__ == '__main__':
    #-------------------------------------------------------------------------------------------------------------------- 
    # function
    f(name='sh', sid=2019)  
    f(sid=2019, name='sh')  # 순서 바뀌어도 됨
    f('sh', 2019)
    f(2019, 'sh')   # argument name 안써주면 순서 안지켰을 경우 바뀌게 됨
    #-------------------------------------------------------------------------------------------------------------------- 


    #--------------------------------------------------------------------------------------------------------------------
    # type test
    str_1 = '1'
    int_1 = 1
    print(str_1 + str_1)
    print(int_1 + int_1)

    # isinstance(확인하고자 하는 데이터 값, 확인하고자 하는 데이터 타입)
    # isinstance(인스턴스, 데이터나 클래스 타입)
    # 첫 번째 매개변수 : 확인하고자 하는 데이터의 값, 객체, 인스턴스
    # 두 번째 매개변수 : 확인하고자 하는 데이터의 타입, 클래스
    # 반환 값 : 인스턴스와 타입이 같으면 True를 반환하고, 다르면 False를 반환
    if isinstance(int_1, int):
        print(int_1 + int_1)
    else:
        print("int_1 is string")
        print(int(int_1) + int(int_1))
    #--------------------------------------------------------------------------------------------------------------------


    #--------------------------------------------------------------------------------------------------------------------
    # operators
    int_3 = [1,2,3]
    int_4 = [1,2,3]


    print(int_3 == int_4)   # ==는 변수의 Value(값)이 같을 때 True를 리턴
    print(int_3 is int_4)   # is는 변수의 Object(객체)가 같을 때 True를 리턴

    # if statements 조건문
    list_1 = range(10)
    for i in list_1:
        if i % 3 == 0:
            print(f'{i} % 3 == 0')
        elif i % 3 == 1:
            print(f'{i} % 3 == 1')
        else:
            print(f'{i} % 3 == 2')
    #--------------------------------------------------------------------------------------------------------------------


    #--------------------------------------------------------------------------------------------------------------------
    # for statements 반복문
    list_2 = [9,8,7,6,5,4,3,2,1,0]
    print(list(enumerate(list_2)))
    for index, i in enumerate(list_2):
        print(index, i)
    #--------------------------------------------------------------------------------------------------------------------


    #--------------------------------------------------------------------------------------------------------------------    
    # list control
    list_3 = [1,2,3]
    list_4 = [4,5]

    # 리스트에 값 추가
    list_3.append(list_4)
    print(list_3)   # [1, 2, 3, [4, 5]]
    list_3.extend(list_4)
    print(list_3)   # [1, 2, 3, 4, 5]
    list_3.insert(3,8)
    print(list_3)

    # 리스트 슬라이스
    # list_name[start:end] -> start <= index < end
    list_range = range(20)
    print(list(list_range[5:10]))   # [5, 6, 7, 8, 9]
    print(list(list_range[5:10:2])) # [5, 7, 9]
    print(list(list_range[:10]))    # [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
    print(list(list_range[10:]))    # [10, 11, 12, 13, 14, 15, 16, 17, 18, 19]
    print(list(list_range[:-1]))    # [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18] (마지막 원소 빼고)
    print(list(list_range[-1:]))    # [19] (마지막만)
    #-------------------------------------------------------------------------------------------------------------------- 